test/integration/data.psphere.inv/request-13.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns0="urn:vim25" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <ns1:Body>
    <ns0:RetrieveProperties>
      <ns0:_this type="PropertyCollector">propertyCollector</ns0:_this>
      <ns0:specSet>
        <ns0:propSet>
          <ns0:type>VirtualMachine</ns0:type>
          <ns0:all>false</ns0:all>
          <ns0:pathSet>guest</ns0:pathSet>
        </ns0:propSet>
        <ns0:objectSet>
          <ns0:obj type="VirtualMachine">vm-34</ns0:obj>
        </ns0:objectSet>
      </ns0:specSet>
    </ns0:RetrieveProperties>
  </ns1:Body>
</SOAP-ENV:Envelope>
