tests/data/requests/get_cluster/cluster_path2.req

<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>Folder</type><pathSet>name</pathSet></propSet><objectSet xsi:type="ObjectSpec"><obj type="Folder">group-h4</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
